{
// DELETE THESE COMMENTS. Make sure not to forget commas/brackets. I would recommend an 
// editor named Visual Studio Code, and there are lots of resources online to help with JSONS
    
    "chip_name": "The chip name (ex. Tokyo)", 
    "chip_image": "The name of the file that corresponds to the high level view",
    "short_description": "Short description from specification (ex. Highly integrated, compact PMIC)",
    "long_description": "Long description (should be in pdf datasheet or on JIRA)",
    "features": [
        "The features section is a list (array) of strings",
        "The strings are separated by commas and enclosed by brackets",
        "The features list comes from the PDF datasheet, an example is given below",

        "Input Voltage Range:2.5V ~ 5.5V",
        "Output Voltage Range:0.7V ~ 1.15V(±2.0%)",
        "1.2V ~ 3.6V(±1.5%)",
        "Output Current:600mA",
        "Quiescent Current:11uA(XC9282 PWM/PFM Auto)",
        "Oscillation Frequency:6MHz",
        "Efficiency:89%(Vin-3.7V,Vout=1.8V,Iout=300mA)",
        "Control Methods:HiSAT-COT Control",
        "PWM Control (SC9281)",
        "PWM/PFM Auto(XC9282)",
        "Protection Functions:Current Limit",
        "Functions:Soft-Start, UVLO",
        "Cl Discharge (TypeB)",
        "Input/Output Capacitor Ceramic Capacitor",
        "Operating Ambient Temperature:-40C ~ +105C",
        "Package:LGA-6B01 (1.2 x 1.2 x 0.3mm)",
        "WLP-5-06(0.88 x 0.96 x 0.33mm)",
        "Environmentally:EU RoHs Complieant, Pb Free"
    ],
    "applications": [
        "The applications section is just like the features section, it should also be located in the datasheet",

        "Smart phone / Mobile phones",
        "Wireless earphone / Headset",
        "Wearable devices",
        "DSC / Camcorder",
        "Portable game consoles",
        "Smartcard",
        "Power supply for module",
        "Various small power sources"
    ],

// DELETE THIS SECTION IN REAL JSON FILES, these are just annotations, but they may cause errors

// The components section is a heirarchy represented by nested JSON objects. 
// Immediately inside the "components" section is the first level of components. In this example
// those are vout, service, regulation, logic, and power. Each component has a description (a short string), 
// and a list of simulations (a list of strings which contains the filenames of the simulations for that 
// component from JIRA). 

// Additionally, a component can also contain another component. See MODULEregulation. 
// // In this case, regulation also contains MODULEfeedback and MODULEcot, meaning that these components are located 
// // on the second level down of the schematic.  Similarly, MODULEfeedback could contain another component, 
// // as illustrated below, meaning that this component is 3 levels down from the top. This could theoretically go 
// on forever, but usually doesn't go deeper than this (as of now). 

// In order to find the component structure, you may have to manually figure it out from JIRA tickets.

    "components": {
        "MODULEvout": {
            "description": "These descriptions are short headers that show up with each component",
            "simulations": []
        },
        "MODULEservice": {
            "description": "This is the service view",
            "simulations": [
                "sim1",
                "sim2"
            ]
        },
        "MODULEregulation": {
            "description": "This is the regulation view",
            "simulations": [],

            "MODULEfeedback": {
                "description": "", 
                "simulations":[],

                "MODULEsamplethirdlevel": {
                    "description": "", 
                    "simulations":[]
                } 
            },

            "MODULEcot": {
                "description": "",
                "simulations": []
            }

        },
        "MODULElogic": {
            "description": "This is the logic view",
            "simulations": []
        },
        "MODULEpower": {
            "description": "This is the power view",
            "simulations": []
        }
    },
    
//DELETE THIS
// This section is just something we included to help with scrolling/page sizing when
// including new information, but isn't too important as of now. You can probably just leave 
// it like this and add a new string if any new section is included on the page for 
// this chip (unlikely right now)

    "sections": [
        "Features",
        "Applications"
    ]
}